{
  "id": "lore.hadar",
  "name": "HADAR",
  "tag": null,
  "chapter": "dmg-2024.appendix-a",
  "status": "draft",
  "description": [
    "HADAR (HAY-dar or ha-DARR), the Dark Hunger, is an ancient stellar entity originating from the Far Realm (see chapter 6). It appears as a cinder-red dying star, barely visible in the night sky, and it siphons life from its minions to avert its own demise. Two widely used Warlock spells invoke Hadar's power (see the Arms of Hadar and Hunger of Hadar spells in the Player's Handbook), and a few Warlocks claim this Elder Evil as their Great Old One patron. The Harpers is a scattered network of spellcasters and spies in the Forgotten Realms setting. Its members advocate equality and covertly oppose the abuse of power, magical or otherwise. The Harpers has risen, been shattered, and risen again several times. The faction's longevity and resilience are largely due to its decentralized, grassroots, secretive nature and the autonomy of its members. It has small cells and lone operatives throughout the Forgotten Realms, although they interact and share information with one another as the need arises. The Harpers' ideology is noble, and members pride themselves on their ingenuity and incorruptibility. Harpers don't seek power or glory, only fair treatment for all. HEROES OF THE LANCE, THE The adventurers known as the Heroes of the Lance, whose deeds helped prevent Takhisis (see Tiamat) and her evil dragons from conquering the world of the Dragonlance setting, began as a small group of young adventurers and their aging dwarf mentor. This original group (known as the Innfellows) consisted of Tanis Half-Elven, the brothers Raistlin and Caramon Majere, Sturm Brightblade, a kender (similar to a halfling) named Tasslehoff Burrfoot, the dwarf Flint ✏ Fireforge, and Kitiara Uth Matar, Raistlin and Caramon's older half-sister. While Kitiara eventually joined Takhisis's service, the heroes were joined by others: Riverwind and Goldmoon, from the nomadic peoples of the plains; Gilthanas and Laurana, elf friends from Tanis's childhood; and Tika Waylan, a young barmaid whom the original Innfellows remembered as just a kid. HEROES OF THE REALM, THE The so-called \"heroes of the Realm\" are a group of young adventurers-Bobby, Diana, Eric, Hank, Presto, and Sheila-who traveled from Earth in the 1980s into a world in the D&D multiverse. Equipped with powerful magic items, they foiled the schemes of foes such as Venger and Tiamat while seeking some means to return home. Eventually, as the heroes' mastery of adventuring skills increased, they discovered the secrets of traveling between worlds, though they still haven't found a way home. The heroes of the Realm weren't the only kids transported from Earth to the worlds of D&D. Other young adventurers, including Niko the Cleric, are still exploring the vast D&D multiverse."
  ],
  "see_also": [],
  "sourceRef": {
    "file": "docs/sources/dm-guide2024/Dungeon Master's Guide (2024) - 5etools.pdf",
    "pages": [
      354
    ],
    "section": "Appendix A: Lore Glossary"
  },
  "notes": []
}