{
  "id": "lore.euryale",
  "name": "EURYALE",
  "tag": null,
  "chapter": "dmg-2024.appendix-a",
  "status": "draft",
  "description": [
    "One card in the Deck of Many Things (see chapter 7) bears a person's proper name, and the card's namesake, Euryale (YUR-ee-ale or yur-EYE-a-lee), is the subject of much speculation. Often assumed to be a fearsome demigod (perhaps the first medusa) or the wielder of a destructive curse, Euryale is actually a key part of the story of the magical deck's creation. After befriending a princess named Asteria and spending many years in her dear friend's company, Euryale was captured and sentenced to death by Asteria's father. Asteria pleaded with the gods to save her friend, and Istus (a god from the Greyhawk setting; see chapter 5) intervened to help the pair rewrite their story, creating the Deck of Many Things. The magic of the deck helped the two escape, and they adventured together across the multiverse. Eventually, Euryale-having become an ancient, wise, and powerful Druid-settled in the Outlands (see chapter 6), where she still sometimes acts as a patron, mentor, or ally for adventurers. Tessalynde is a young elf Rogue who dreams of leading the foremost adventuring party of the Forgotten Realms setting. While the crew she's gathered isn't the stuff of legend yet, she's confident her guidance can get them there. Called the Fallbacks, the team includes Anson, a human Fighter too stubborn to stay down; Cazrin, a self-taught, human Wizard determined to test her theoretical mettle against the real world; Baldric, a dwarf Cleric who refuses to tie himself to a single deity when he can trade favors with them all; Lark, a tiefling Bard with as many secrets as songs; and Uggie, a pet otyugh. Scholars speak of a primordial state, a single reality they call the First World, which preceded the Material Plane. Many of the peoples and monsters that inhabit the worlds on the Material Plane originated there. After the First World was shattered by a great cataclysm-giving birth to the worlds that came in its wake-the progeny of the first elves, dwarves, beholders, and other iconic creatures took root on world after world, like seeds scattered by a cosmic wind. If the musings of these great sages are true, every world of the Material Plane is a reflection-or, in some cases, a distortion-of the First World."
  ],
  "see_also": [],
  "sourceRef": {
    "file": "docs/sources/dm-guide2024/Dungeon Master's Guide (2024) - 5etools.pdf",
    "pages": [
      354
    ],
    "section": "Appendix A: Lore Glossary"
  },
  "notes": []
}