{
  "id": "lore.phandalin",
  "name": "PHANDALIN",
  "tag": null,
  "chapter": "dmg-2024.appendix-a",
  "status": "draft",
  "description": [
    "The frontier town of Phandalin (FAN-duh-lin or fan-DAY-lin) in the Sword Coast region of the Forgotten Realms setting is built on the ruins of a much older settlement. Hundreds of years ago, old Phandalin was a thriving town until it was sacked by bandits and lay abandoned for centuries. In the past few years, hardy folk from the cities of Neverwinter and Waterdeep have begun settling atop the ruins of old Phandalin. It's now home to farmers, woodcutters, fur traders, and prospectors drawn by stories of gold and platinum in the foothills of the Sword Mountains-as well as more than a few ruffians and bandits. PRINCE OF FROST, THE The Prince of Frost is a son of Titania, the Summer Queen. He was once known as the Sun Prince, but his heart grew cold when he was spurned by the fey noble he loved. He is now a creature of wrath and winter, ruling from his Fortress of Frozen Tears in the Vale of Long Night in the Feywild (see chapter 6). He detests mortals of the Material Plane and dreams of covering their many worlds with perpetual winter. The Prince of Frost QUEEN OF AIR AND DARKNESS, THE The mysterious Queen of Air and Darkness is the archfey ruler of the Gloaming Court in the Feywild (see chapter 6). Though she is often described as malicious and evil, her motivations are as obscure and whimsical as any other archfey's. She gives supernatural boons and terrible curses with equal whimsy, with little regard for the elaborate customs surrounding gifts and favors in other courts of the Feywild. Though she is said to have a spectral form resembling a terrifying elf, to the unaided eye she appears as a strange, black diamond, hovering in the air like the slitted pupil of an unseen cat. The Raven Queen is a being of mystery. Those who claim to have encountered her have described an array of disturbing images: a terrible shadow that clawed at their innermost thoughts, a pale and regal elf who exploded into an untold number of ravens, a shambling tangle of slick roots and sticks that overwhelmed them with dread, or an unknown presence that pulled them screaming into the gloom. Despite all attempts to demystify her, the Raven Queen has remained enigmatic and aloof. She rules from her Raven Throne within the Fortress of Memories, a mazelike castle deep within the bleakness of the Shadowfell (see chapter 6). From there she sends out her raven servants to find interesting souls she can pluck from the planes of existence. Once these souls are in the Shadowfell, she watches as they attempt to unravel the mystery of their being. ✏ ROCK OF BRAL, THE Bral is a city built on an asteroid that drifts through Wildspace (see chapter 6). Its inhabitants, who hail from many worlds across the Material Plane, typically refer to Bral as the Rock. There is no other place quite like it in Wildspace-a teeming hive of business that spans the breadth of the Astral Sea. Bral is populated by an outlandish collection of traders, scoundrels, mercenaries, pirates, nobles, and entrepreneurs. Generally, law enforcement is sporadic, which means that order is elusive. Most folks who call the Rock home adhere to two principles: mind your own business whenever possible, and enough gold can fix anything."
  ],
  "see_also": [],
  "sourceRef": {
    "file": "docs/sources/dm-guide2024/Dungeon Master's Guide (2024) - 5etools.pdf",
    "pages": [
      354
    ],
    "section": "Appendix A: Lore Glossary"
  },
  "notes": []
}