{
  "id": "subclass.wiz.illusionist",
  "parent_class": "class.wizard",
  "chapter": 3,
  "title": "School of Illusion",
  "status": "complete",
  "source": {
    "file": "Character Classes (Continued) 81-94.pdf",
    "pages": [88, 94],
    "section_hint": "Illusionist"
  },
  "feature_levels": [3, 6, 10, 14],
  "features_by_level": {
    "3": ["improved_illusions"],
    "6": ["phantasmal_creatures"],
    "10": ["illusory_self"],
    "14": ["illusory_reality"]
  },
  "feature_defs": [
    {
      "id": "feat.illusionist.improved_illusions",
      "action_type": "none",
      "trigger": "when you cast an illusion spell",
      "effects": [
        "you can cast it without verbal components",
        "if the spell has a range of 10 ft or more, its range increases by 60 ft",
        "Minor Illusion is enhanced per subclass text"
      ],
      "notes": [
        "Minor Illusion improvements include expanded usage and bonus-action casting; keep exact Minor Illusion tweaks in feature notes if needed by your engine."
      ]
    },
    {
      "id": "feat.illusionist.phantasmal_creatures",
      "action_type": "none",
      "trigger": "passive",
      "effects": [
        "Summon Beast and Summon Fey are always prepared for you",
        "you can cast each of those spells once without expending a spell slot, and you regain the ability to do so when you finish a long rest",
        "creatures summoned by those free casts have half their normal hit points"
      ],
      "limits": [
        "one free cast per spell per long rest",
        "half hit points applies only to the free-cast versions"
      ]
    },
    {
      "id": "feat.illusionist.illusory_self",
      "action_type": "reaction",
      "trigger": "when you are hit by an attack",
      "effects": [
        "you can cause the attack to miss you instead"
      ],
      "limits": [
        "once per short or long rest"
      ],
      "notes": [
        "You can also restore this feature by expending a spell slot of level 2 or higher (no action)."
      ]
    },
    {
      "id": "feat.illusionist.illusory_reality",
      "action_type": "bonus_action",
      "trigger": "on your turn while an illusion spell of level 1 or higher that you cast is ongoing",
      "effects": [
        "choose one inanimate, nonmagical object that is part of the illusion and make it real for 1 minute"
      ],
      "limits": [
        "object must be no larger than a 5-foot cube",
        "object can’t deal damage or otherwise directly harm a creature",
        "object can’t grant a condition to a creature"
      ],
      "duration": { "kind": "minutes", "value": 1 }
    }
  ],
  "notes": [
    "Illusory Reality is a bonus action while an eligible illusion persists and the real object lasts 1 minute.",
    "Illusory Self recharge can be restored by expending a level 2+ slot without an action."
  ]
}
