{
  "id": "spell.scrying",
  "name": "Scrying",
  "chapter": 7,
  "status": "complete",
  "level": 5,
  "school": "Divination",
  "classes": [
    "class.bard",
    "class.cleric",
    "class.druid",
    "class.warlock",
    "class.wizard"
  ],
  "casting_time": "10 minutes",
  "range": "Self",
  "components": {
    "flags": [
      "V",
      "S",
      "M"
    ],
    "material": "a focus worth 1,000+ GP, such as a crystal ball, mirror, or water-filled font"
  },
  "duration": "Concentration, up to 10 minutes",
  "description": [
    "You can see and hear a creature you choose that is on the same plane of existence as you. The target makes a Wisdom saving throw, which is modified (see the tables below) by how well you know the target and the sort of physical connection you have to it. The target doesn't know what it is making the save against, only that it feels uneasy. Your Knowledge of the Target Is... \tSave Modifier Secondhand (heard of the target) \t+5 Firsthand (met the target) \t+0 Extensive (know the target well) \t5 You Have the Target's... \tSave Modifier Picture or other likeness \t2 Garment or other possession \t4 Body part, lock of hair, or bit of nail \t10 On a successful save, the target isn't affected, and you can't use this spell on it again for 24 hours. On a failed save, the spell creates an Invisible, intangible sensor within 10 feet of the target. You can see and hear through the sensor as if you were there. The sensor moves with the target, remaining within 10 feet of it for the duration. If something can see the sensor, it appears as a luminous orb about the size of your fist. Instead of targeting a creature, you can target a location you have seen. When you do so, the sensor appears at that location and doesn't move."
  ],
  "higher_level": null,
  "sourceRef": {
    "file": "docs/sources/phb2024/09-chapter7/10-Spell Descriptions - Player’s Handbook - Dungeons & Dragons - Sources - D&D Beyond.pdf",
    "pages": [
      117
    ],
    "section": "Spell Descriptions"
  },
  "notes": []
}
