{
  "id": "spell.dream",
  "name": "Dream",
  "chapter": 7,
  "status": "complete",
  "level": 5,
  "school": "Illusion",
  "classes": [
    "class.bard",
    "class.warlock",
    "class.wizard"
  ],
  "casting_time": "1 minute",
  "range": "Special",
  "components": {
    "flags": [
      "V",
      "S",
      "M"
    ],
    "material": "a handful of sand"
  },
  "duration": "8 hours",
  "description": [
    "You target a creature you know on the same plane of existence. You or a willing creature you touch enters a trance state to act as a dream messenger. While in the trance, the messenger is Incapacitated and has a Speed of 0. If the target is asleep, the messenger appears in the target's dreams and can converse with the target as long as it remains asleep, through the spell's duration. The messenger can also shape the dream's environment, creating landscapes, objects, and other images. The messenger can emerge from the trance at any time, ending the spell. The target recalls the dream perfectly upon waking. If the target is awake when you cast the spell, the messenger knows it and can either end the trance (and the spell) or wait for the target to sleep, at which point the messenger enters its dreams. You can make the messenger terrifying to the target. If you do so, the messenger can deliver a message of no more than ten words, and then the target makes a Wisdom saving throw. On a failed save, the target gains no benefit from its rest, and it takes 3d6 Psychic damage when it wakes up. Druidcraft",
    "-- 45 of 163 --",
    "Transmutation Cantrip (Druid) Casting Time: Action Range: 30 feet Components: V, S Duration: Instantaneous Whispering to the spirits of nature, you create one of the following effects within range. Weather Sensor. You create a Tiny, harmless sensory effect that predicts what the weather will be at your location for the next 24 hours. The effect might manifest as a golden orb for clear skies, a cloud for rain, falling snowflakes for snow, and so on. This effect persists for 1 round. Bloom. You instantly make a flower blossom, a seed pod open, or a leaf bud bloom. Sensory Effect. You create a harmless sensory effect, such as falling leaves, spectral dancing fairies, a gentle breeze, the sound of an animal, or the faint odor of skunk. The effect must fit in a 5-foot Cube. Fire Play. You light or snuff out a candle, a torch, or a campfire."
  ],
  "higher_level": null,
  "sourceRef": {
    "file": "docs/sources/phb2024/09-chapter7/10-Spell Descriptions - Player’s Handbook - Dungeons & Dragons - Sources - D&D Beyond.pdf",
    "pages": [
      44
    ],
    "section": "Spell Descriptions"
  },
  "notes": []
}
