{
  "id": "spell.summon_celestial",
  "name": "Summon Celestial",
  "chapter": 7,
  "status": "complete",
  "level": 5,
  "school": "Conjuration",
  "classes": [
    "class.cleric",
    "class.paladin"
  ],
  "casting_time": "Action",
  "range": "90 feet",
  "components": {
    "flags": [
      "V",
      "S",
      "M"
    ],
    "material": "a reliquary worth 500+ GP"
  },
  "duration": "Concentration, up to 1 hour",
  "description": [
    "You call forth a Celestial spirit. It manifests in an angelic form in an unoccupied space that you can see within range and uses the Celestial Spirit stat block. When you cast the spell, choose Avenger or Defender. Your choice determines certain details in its stat block. The creature disappears when it drops to 0 Hit Points or when the spell ends. The creature is an ally to you and your allies. In combat, the creature shares your Initiative count, but it takes its turn immediately after yours. It obeys your verbal commands (no action required by you). If you don't issue any, it takes the Dodge action and uses its movement to avoid danger. Using a Higher-Level Spell Slot. Use the spell slot's level for the spell's level in the stat block. Summon Construct CELESTIAL SPIRIT (AVENGER) CELESTIAL SPIRIT AC 11 + the spell's level + 2 (Defender only) HP 40 + 10 for each spell level above 5 Speed 30 ft., Fly 40 ft. MOD \tSAVE STR \t16 \t+3 \t+3 DEX \t14 \t+2 \t+2 CON \t16 \t+3 \t+3 MOD \tSAVE INT \t10 \t+0 \t+0 WIS \t14 \t+2 \t+2 CHA \t16 \t+3 \t+3 Resistances Radiant Immunities Charmed, Frightened Senses Darkvision 60 ft.; Passive Perception 12 Languages Celestial, understands the languages you know CR None (XP 0; PB equals your Proficiency Bonus) Actions Multiattack. The spirit makes a number of attacks equal to half this spell's level (round down). Radiant Bow (Avenger Only). Ranged Attack Roll: Bonus equals your spell attack modifier, range 600 ft. Hit: 2d6 + 2 + the spell's level Radiant damage. Radiant Mace (Defender Only). Melee Attack Roll: Bonus equals your spell attack modifier, reach 5 ft. Hit: 1d10 + 3 + the spell's level Radiant damage, and the spirit can choose itself or another creature it can see within 10 feet of the target. The chosen creature gains 1d10 Temporary Hit Points. Healing Touch (1/Day). The spirit touches another creature. The target regains Hit Points equal to 2d8 + the spell's level. Large Celestial, Neutral",
    "-- 134 of 163 --",
    "Level 4 Conjuration (Wizard) Casting Time: Action Range: 90 feet Components: V, S, M (a lockbox worth 400+ GP) Duration: Concentration, up to 1 hour You call forth the spirit of a Construct. It manifests in an unoccupied space that you can see within range and uses the Construct Spirit stat block. When you cast the spell, choose a material: Clay, Metal, or Stone. The creature resembles an animate statue (you determine the appearance) made of the chosen material, which determines certain details in its stat block. The creature disappears when it drops to 0 Hit Points or when the spell ends. The creature is an ally to you and your allies. In combat, the creature shares your Initiative count, but it takes its turn immediately after yours. It obeys your verbal commands (no action required by you). If you don't issue any, it takes the Dodge action and uses its movement to avoid danger. Using a Higher-Level Spell Slot. Use the spell slot's level for the spell's level in the stat block. CONSTRUCT SPIRIT (STONE) ARTIST: HECTOR ORTIZ CONSTRUCT SPIRIT AC 13 + the spell's level HP 40 + 15 for each spell level above 4 Speed 30 ft. MOD \tSAVE STR \t18 \t+4 \t+4 DEX \t10 \t+0 \t+0 CON \t18 \t+4 \t+4 MOD \tSAVE INT \t14 \t+2 \t+2 WIS \t11 \t+0 \t+0 CHA \t5 \t3 \t3 Resistances Poison Immunities Charmed, Exhaustion, Frightened, Paralyzed, Poisoned Senses Darkvision 60 ft.; Passive Perception 10 Languages Understands the languages you know CR None (XP 0; PB equals your Proficiency Bonus) Traits Heated Body (Metal Only). A creature that hits the spirit with a melee attack or that starts its turn in a grapple with the spirit takes 1d10 Fire damage. Stony Lethargy (Stone Only). When a creature starts its turn within 10 feet of the spirit, the spirit can target it with magical energy if the spirit can see it. Wisdom Saving Throw: DC equals your spell save DC, the target. Failure: Until the start of its next turn, the target can't make Opportunity Attacks, and its Speed is halved. Actions Multiattack. The spirit makes a number of Slam attacks equal to half this spell's level (round down). Slam. Melee Attack Roll: Bonus equals your spell attack modifier, reach 5 ft. Hit: 1d8 + 4 + the spell's level Bludgeoning damage. Medium Construct, Neutral",
    "-- 135 of 163 --"
  ],
  "higher_level": null,
  "sourceRef": {
    "file": "docs/sources/phb2024/09-chapter7/10-Spell Descriptions - Player’s Handbook - Dungeons & Dragons - Sources - D&D Beyond.pdf",
    "pages": [
      132
    ],
    "section": "Spell Descriptions"
  },
  "notes": []
}
