{
  "schema_version": "0.1",
  "type": "character_classes",
  "source": "PHB 2024 (D&D Beyond exports provided by user)",
  "detected_headings": [],
  "raw_excerpt": " Character Classes - Player’s Handbook - Dungeons &amp; Dragons - Sources - D&amp;D Beyond This site works best with JavaScript enabled. Please enable JavaScript to get the best experience from this site. Skip to Content D&amp;D Beyond Rakoren91 Profile Account Redeem a Key Threads Campaigns Characters Homebrew Subscribe Sign Out D&amp;D Beyond Collections My Characters My Campaigns My Encounters My Dice My Homebrew Collection My Homebrew Creations Browse &amp; Create Homebrew Game Rules Classes Backgrounds Species Feats Spells Magic Items Monsters Equipment Library View All Sourcebooks Unearthed Arcana D&amp;D Beyond Basic Rules Player&#x27;s Handbook Dungeon Master’s Guide Monster Manual Sage Advice &amp; Errata Bigby Presents: Glory of the Giants Cthulhu by Torchlight Eberron: Rising from the Last War Explorer’s Guide to Wildemount Fizban’s Treasury of Dragons Forgotten Realms: Heroes of Faerûn Lorwyn: First Light Mordenkainen Presents: Monsters of the Multiverse Planescape: Adventures in the Multiverse Spelljammer: Adventures in Space Tasha’s Cauldron of Everything The Book of Many Things Xanathar’s Guide to Everything Adventures Astarion&#x27;s Book of Hungers Baldur’s Gate: Descent into Avernus Critical Role: Call of the Netherdeep Curse of Strahd Dragon Delves Dragonlance: Shadow of the Dragon Queen Forgotten Realms: Adventures in Faerûn Ghosts of Saltmarsh Heroes of the Borderlands Icewind Dale: Rime of the Frostmaiden Journeys through the Radiant Citadel Keys from the Golden Vault Netheril’s Fall One-Shot Wonders: Holiday Adventure Pack Phandelver and Below: The Shattered Obelisk Princes of the Apocalypse Storm King’s Thunder Stranger Things: Welcome to the Hellfire Club Tales from the Yawning Portal The Wild Beyond the Witchlight Tomb of Annihilation Tyranny of Dragons Vecna: Eve of Ruin Waterdeep: Dragon Heist Waterdeep: Dungeon of the Mad Mage Tools Character Builder Sigil 3D VTT Maps VTT Encounters Mobile App Avrae Discord Bot Media Community Update Twitch YouTube Changelog Forums New Player Guide Subscribe Redeem A Key Marketplace Desktop View Sign Out Collections My Characters My Campaigns Beta My Encounters My Homebrew Collection My Homebrew Creations My Dice Homebrew Create Spell Create Monster Create Magic Item Create Background Create Feat Create Species Create Subclass Browse Spells Browse Monsters Browse Magic Items Browse Backgrounds Browse Feats Browse Species Browse Subclasses Game Rules Classes Backgrounds Species Feats Spells Equipment Magic Items Monsters Library Tools Character Builder Sigil 3D VTT Beta Maps VTT Beta Encounters Mobile App Avrae Discord Bot Media Community Update Twitch Youtube Changelog Forums Learn to Play Subscribe Marketplace Home Sources Dungeons &amp; Dragons Player’s Handbook Character Classes Character Classes Character Classes Character Classes Posted by GPyromania Aug 31, 2024 Chapter 3: Character Classes ANDREA PIPARO The heroes Mercion, Molliver, Strongheart, and Ringlerun protect a portal to another plane from diabolical invaders Character class provides a character’s most exciting capabilities. This chapter offers twelve classes, each of which contains four subclasses—all summarized below. Barbarian. Storm with Rage, and wade into hand-to-hand combat. Then follow the Path of the... Berserker to unleash raw violence. Wild Heart to manifest kinship with animals. World Tree to tap into cosmic vitality. Zealot to rage in union with a god. Bard. Perform spells that inspire and heal allies or beguile foes. Then join the College of... Dance to harness agility in battle. Glamour to weave beguiling Feywild magic. Lore to collect knowledge and magical secrets. Valor to wield weapons with spells. Cleric. Invoke divine magic to heal, bolster, and smite. Then harness the... Life Domain to be a master of healing. Light Domain to wield searing, warding light. Trickery Domain to bedevil foes with mischief. War Domain to inspire valor and chastise foes. Druid. Channel nature magic to heal, shape-shift, and control the elements. Then join the Circle of the... Land to draw on the magic of the environment. Moon to adopt powerful animal forms. Sea to channel tides and storms. Stars to gain powers in a starry form. Fighter. Master all weapons and armor. Then embody the... Battle Master to use special combat maneuvers. Champion to strive for peak combat prowess. Eldritch Knight to learn spells to aid in combat. Psi Warrior to augment attacks with psionic power. Monk. Dart in and out of melee while striking fast and hard. Then become a Warrior of... Mercy to heal or harm with a touch. Shadow to employ shadows for subterfuge. The Elements to wield elemental power. The Open Hand to master unarmed combat. Paladin. Smite foes and shield allies with divine and martial might. Then swear the Oath of... Devotion to emulate the angels of justice. Glory to reach the heights of heroism. The Ancients to preserve life, joy, and nature. Vengeance to hunt down evildoers. Ranger. Weave together martial prowess, nature magic, and survival skills. Then embody the... Beast Master to bond with a primal beast. Fey Wanderer to manifest fey mirth and fury. Gloom Stalker to hunt foes that lurk in darkness. Hunter to protect nature with martial versatility. Rogue. Launch deadly Sneak Attacks while avoiding harm through stealth. Then embody the... Arcane Trickster to enhance stealth with spells. Assassin to deliver ambushes and poison. Soulknife to strike foes with psi blades. Thief to master infiltration and treasure hunting. Sorcerer. Wield magic innate to your being, shaping the power to your will. Then channel... Aberrant Sorcery to use strange psionic magic. Clockwork Sorcery to harness cosmic forces of order. Draconic Sorcery to breathe the magic of dragons. Wild Magic to unleash chaos magic. Warlock. Cast spells derived from occult knowledge. Then form a pact with the... Archfey Patron to teleport and wield fey magic. Celestial Patron to heal with heavenly magic. Fiend Patron to call on sinister powers. Great Old One Patron to delve into forbidden lore. Wizard. Study arcane magic and master spells for every purpose. Then embody the... Abjurer to shield allies and banish foes. Diviner to learn the multiverse’s secrets. Evoker to create explosive effects. Illusionist to weave spells of deception. Barbarian DENMAN ROOKE A Fierce Warrior of Primal Rage Core Barbarian Traits Primary Ability Strength Hit Point Die D12 per Barbarian level Saving Throw Proficiencies Strength and Constitution Skill Proficiencies Choose 2: Animal Handling , Athletics , Intimidation , Nature , Perception , or Survival Weapon Proficiencies Simple and Martial weapons Armor Training Light and Medium armor and Shields Starting Equipment Choose A or B: (A) Greataxe , 4 Handaxes , Explorer’s Pack , and 15 GP; or (B) 75 GP Barbarians are mighty warriors who are powered by primal forces of the multiverse that manifest as a Rage. More than a mere emotion—and not limited to anger—this Rage is an incarnation of a predator’s ferocity, a storm’s fury, and a sea’s turmoil. Some Barbarians personify their Rage as a fierce spirit or revered forebear. Others see it as a connection to the pain and anguish of the world, as an impersonal tangle of wild magic, or as an expression of their own deepest self. For every Barbarian, their Rage is a power that fuels not just battle prowess, but also uncanny reflexes and heightened senses. Barbarians often serve as protectors and leaders in their communities. They charge headlong into danger so those under their protection don’t have to. Their courage in the face of danger makes Barbarians perfectly suited for adventure. Becoming a Barbarian... As a Level 1 Character Gain all the traits in the Core Barbarian Traits table . Gain the Barbarian’s level 1 features, which are listed in the Barbarian Features table . As a Multiclass Character Gain the following traits from the Core Barbarian Traits table : Hit Point Die, proficiency with Martial"
}